status/2021/14may21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>08 May 2021 - 14 May 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">08 May 2021 - 14 May 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd3e15be">1. Linux Audio</a>
<ul>
<li><a href="#orgc461db3">1.1. Faust programming</a></li>
<li><a href="#org1f1f6a5">1.2. Next Steps</a>
<ul>
<li><a href="#orgb493168">1.2.1. Analog Synthesizer modules</a></li>
<li><a href="#org50a3a32">1.2.2. LV2 autopatcher</a></li>
<li><a href="#org602c08c">1.2.3. OSC control surface</a></li>
<li><a href="#org6af606a">1.2.4. Faust/csound</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdd8003c">2. Santa Cruz Weather Station</a>
<ul>
<li><a href="#org12bc960">2.1. Next step</a>
<ul>
<li><a href="#org24d56bd">2.1.1. Check replacement sensor</a></li>
<li><a href="#org009f628">2.1.2. Clean BME680/VELM6075 boards</a></li>
<li><a href="#orgd289f97">2.1.3. Design more robust instrument shelter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgca3ea00">3. EPICS</a>
<ul>
<li><a href="#orgf5afe7b">3.1. Next steps</a>
<ul>
<li><a href="#orga2d3353">3.1.1. u3scpi network port testing</a></li>
<li><a href="#orgd907179">3.1.2. initial EPICS interface</a></li>
<li><a href="#org5fab249">3.1.3. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org57692bd">4. Brini Tracker II</a>
<ul>
<li><a href="#orgfee4e32">4.1. Next steps</a>
<ul>
<li><a href="#org36207b3">4.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#orgb0de3b6">4.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#orgf7131e4">4.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3105788">5. wktcolor</a>
<ul>
<li><a href="#org911e301">5.1. Next steps</a>
<ul>
<li><a href="#org999fd7a">5.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgaa767ab">6. wktplot</a>
<ul>
<li><a href="#org77b19d8">6.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org9ca46c9">7. ca-r</a>
<ul>
<li><a href="#org6490b46">7.1. Seems to have survived Fedora 34 update</a></li>
<li><a href="#org8391cfe">7.2. Next Step</a></li>
</ul>
</li>
<li><a href="#org79e7895">8. AMDGPU</a>
<ul>
<li><a href="#org2e665ce">8.1. Next step</a>
<ul>
<li><a href="#org492766f">8.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org76bb993">9. Ninja v Make</a>
<ul>
<li><a href="#org62f9e8d">9.1. Next Step</a>
<ul>
<li><a href="#org2e99c35">9.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4d207f3">10. Conical Rolling Pin</a>
<ul>
<li><a href="#org9f88971">10.1. Next Step</a></li>
</ul>
</li>
<li><a href="#org650c705">11. Reading</a>
<ul>
<li><a href="#org5cc5407">11.1. Infinite Powers</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Overcoming Audio Frustration
</p>

<div id="outline-container-orgd3e15be" class="outline-2">
<h2 id="orgd3e15be"><span class="section-number-2">1.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-1">
<p>
Ecasound cannot host Faust generated LV2 plugins. purr-data appears
to be able to host LADSPA plugins, and it's not clear the additional
capabilities of LV2 are entirely necessary in that context.
</p>

<p>
Faust programs perhaps are manageable as standalone Jack/Qt
applications, PD plugins and CSound plugins. LV2, if needed would be
handled separately. It is interesting to fall back to PD and
CSound - both venerable audio applications. A rough observation is
that many newer applications, such as ossia, incorporate so many
dependencies that building becomes increasingly fragile.
</p>
</div>

<div id="outline-container-orgc461db3" class="outline-3">
<h3 id="orgc461db3"><span class="section-number-3">1.1.</span> Faust programming</h3>
<div class="outline-text-3" id="text-1-1">
<p>
As a programming exercise, started fleshing out a set of classic
analog synthesizer modules based on the E-Mu 1976 modular
synthesizer catalog. Interestingly, it's the control modules (like
the sequencer) that are proving the most challenging.
</p>
</div>
</div>
<div id="outline-container-org1f1f6a5" class="outline-3">
<h3 id="org1f1f6a5"><span class="section-number-3">1.2.</span> Next Steps</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgb493168" class="outline-4">
<h4 id="orgb493168"><span class="section-number-4">1.2.1.</span> Analog Synthesizer modules</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Let's see how far I can get.
</p>
</div>
</div>
<div id="outline-container-org50a3a32" class="outline-4">
<h4 id="org50a3a32"><span class="section-number-4">1.2.2.</span> LV2 autopatcher</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</div>
<div id="outline-container-org602c08c" class="outline-4">
<h4 id="org602c08c"><span class="section-number-4">1.2.3.</span> OSC control surface</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</div>
<div id="outline-container-org6af606a" class="outline-4">
<h4 id="org6af606a"><span class="section-number-4">1.2.4.</span> Faust/csound</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
See if a faust generated unit works.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdd8003c" class="outline-2">
<h2 id="orgdd8003c"><span class="section-number-2">2.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org12bc960" class="outline-3">
<h3 id="org12bc960"><span class="section-number-3">2.1.</span> Next step</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org24d56bd" class="outline-4">
<h4 id="org24d56bd"><span class="section-number-4">2.1.1.</span> Check replacement sensor</h4>
</div>
<div id="outline-container-org009f628" class="outline-4">
<h4 id="org009f628"><span class="section-number-4">2.1.2.</span> Clean BME680/VELM6075 boards</h4>
</div>
<div id="outline-container-orgd289f97" class="outline-4">
<h4 id="orgd289f97"><span class="section-number-4">2.1.3.</span> Design more robust instrument shelter</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Use existing small mast for VEML6075; put others in larger shelter.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgca3ea00" class="outline-2">
<h2 id="orgca3ea00"><span class="section-number-2">3.</span> EPICS</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf5afe7b" class="outline-3">
<h3 id="orgf5afe7b"><span class="section-number-3">3.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orga2d3353" class="outline-4">
<h4 id="orga2d3353"><span class="section-number-4">3.1.1.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-orgd907179" class="outline-4">
<h4 id="orgd907179"><span class="section-number-4">3.1.2.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-org5fab249" class="outline-4">
<h4 id="org5fab249"><span class="section-number-4">3.1.3.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>

<div id="outline-container-org57692bd" class="outline-2">
<h2 id="org57692bd"><span class="section-number-2">4.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-4">
<p>
Still working!
</p>
</div>
<div id="outline-container-orgfee4e32" class="outline-3">
<h3 id="orgfee4e32"><span class="section-number-3">4.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org36207b3" class="outline-4">
<h4 id="org36207b3"><span class="section-number-4">4.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-orgb0de3b6" class="outline-4">
<h4 id="orgb0de3b6"><span class="section-number-4">4.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-orgf7131e4" class="outline-4">
<h4 id="orgf7131e4"><span class="section-number-4">4.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-org3105788" class="outline-2">
<h2 id="org3105788"><span class="section-number-2">5.</span> wktcolor</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org911e301" class="outline-3">
<h3 id="org911e301"><span class="section-number-3">5.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org999fd7a" class="outline-4">
<h4 id="org999fd7a"><span class="section-number-4">5.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgaa767ab" class="outline-2">
<h2 id="orgaa767ab"><span class="section-number-2">6.</span> wktplot</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org77b19d8" class="outline-3">
<h3 id="org77b19d8"><span class="section-number-3">6.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
</p>
</div>
</div>
</div>

<div id="outline-container-org9ca46c9" class="outline-2">
<h2 id="org9ca46c9"><span class="section-number-2">7.</span> ca-r</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org6490b46" class="outline-3">
<h3 id="org6490b46"><span class="section-number-3">7.1.</span> Seems to have survived Fedora 34 update</h3>
</div>
<div id="outline-container-org8391cfe" class="outline-3">
<h3 id="org8391cfe"><span class="section-number-3">7.2.</span> Next Step</h3>
<div class="outline-text-3" id="text-7-2">
<p>
None
</p>
</div>
</div>
</div>

<div id="outline-container-org79e7895" class="outline-2">
<h2 id="org79e7895"><span class="section-number-2">8.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org2e665ce" class="outline-3">
<h3 id="org2e665ce"><span class="section-number-3">8.1.</span> Next step</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org492766f" class="outline-4">
<h4 id="org492766f"><span class="section-number-4">8.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-org76bb993" class="outline-2">
<h2 id="org76bb993"><span class="section-number-2">9.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org62f9e8d" class="outline-3">
<h3 id="org62f9e8d"><span class="section-number-3">9.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org2e99c35" class="outline-4">
<h4 id="org2e99c35"><span class="section-number-4">9.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-org4d207f3" class="outline-2">
<h2 id="org4d207f3"><span class="section-number-2">10.</span> Conical Rolling Pin</h2>
<div class="outline-text-2" id="text-10">
<p>
Conical Rolling pin worked great except the sharp point dug into the
dough.  Point isn't necessary.
</p>
</div>
<div id="outline-container-org9f88971" class="outline-3">
<h3 id="org9f88971"><span class="section-number-3">10.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Soften point.
</p>
</div>
</div>
</div>
<div id="outline-container-org650c705" class="outline-2">
<h2 id="org650c705"><span class="section-number-2">11.</span> Reading</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org5cc5407" class="outline-3">
<h3 id="org5cc5407"><span class="section-number-3">11.1.</span> Infinite Powers</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Steven Strogatz
<a href="http://www.stevenstrogatz.com/books/infinite-powers">http://www.stevenstrogatz.com/books/infinite-powers</a>
History of Calculus
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>